# Operation Devami;

In [17]:
import numpy as np

In [18]:
import pandas as pd

## Ayri Ayri olusturulmus birden fazla Data Frame'i birlestirelim;

In [37]:
concatdata1 = {'Isim':['Ahmet', 'Mehmet', 'Zeynep', 'Atıl'], 'Spor':['Kosu', 'Yuzme', 'Kosu', 'Basketbol'],
        'Kalori':[100, 300, 240, 200]}

In [38]:
data1DataFrame = pd.DataFrame(data=concatdata1, index=[0, 1, 2, 3])

In [39]:
data1DataFrame

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     300
2  Zeynep       Kosu     240
3    Atıl  Basketbol     200

In [40]:
concatdata2 = {'Isim':['Osman', 'Levent', 'Atlas', 'Fatma'], 'Spor':['Sorf', 'Yuzme', 'Futbol', 'Fitness'],
        'Kalori':[100, 200, 340, 150]}

In [41]:
data2DataFrame = pd.DataFrame(data=concatdata2, index=[4, 5, 6, 7])

In [42]:
data2DataFrame

     Isim     Spor  Kalori
4   Osman     Sorf     100
5  Levent    Yuzme     200
6   Atlas   Futbol     340
7   Fatma  Fitness     150

In [44]:
concatdata3 = {'Isim':['Ayse', 'Mahmut', 'Duygu', 'Nur'], 'Spor':['Fitness', 'Tenis', 'Badminton', 'Basketbol'],
        'Kalori':[300, 200, 540, 420]}

In [45]:
data3DataFrame = pd.DataFrame(data=concatdata3, index=[8, 9, 10, 11])

In [46]:
data3DataFrame

      Isim       Spor  Kalori
8     Ayse    Fitness     300
9   Mahmut      Tenis     200
10   Duygu  Badminton     540
11     Nur  Basketbol     420

## Concatenation; 
### Eger Data Frame'lerin yapisi ayniysa alt alta birlestirebiliriz;
Alt Alta birlestidigi icin yani ROW'da axis=0 olur!

In [47]:
pd.concat([data1DataFrame, data2DataFrame, data3DataFrame])

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     300
2   Zeynep       Kosu     240
3     Atıl  Basketbol     200
4    Osman       Sorf     100
5   Levent      Yuzme     200
6    Atlas     Futbol     340
7    Fatma    Fitness     150
8     Ayse    Fitness     300
9   Mahmut      Tenis     200
10   Duygu  Badminton     540
11     Nur  Basketbol     420

## Merge
### Eger Data Frame'ler tamamen ayni degilse ancak Ortak Row'lari varsa birlestirme yapabiliriz;

In [53]:
mergedata1 = {'Isim':['Ahmet', 'Mehmet', 'Zeynep', 'Atıl'], 'Spor':['Kosu', 'Yuzme', 'Kosu', 'Basketbol']}

In [54]:
mergedata1DataFrame = pd.DataFrame(data=mergedata1, index=[0, 1, 2, 3])

In [56]:
mergedata1DataFrame

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yuzme
2  Zeynep       Kosu
3    Atıl  Basketbol

In [61]:
mergedata2 = {'Isim':['Ahmet', 'Mehmet', 'Zeynep', 'Atıl'], 'Kalori':[100, 200, 340, 150]}

In [62]:
mergedata2DataFrame = pd.DataFrame(data=mergedata2, index=[0, 1, 2, 3])

In [63]:
mergedata2DataFrame

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     340
3    Atıl     150

### merge() fonksiyonu;

In [65]:
pd.merge(mergedata1DataFrame, mergedata2DataFrame, on='Isim')

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     340
3    Atıl  Basketbol     150